examples/uniform/CFDEM_Example_SI/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       25100;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       25200;
    }
    repeat_boundary
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3600;
        startFace       25300;
    }
)

// ************************************************************************* //
